jmeter_load_testing/Signup.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Signup" enabled="true">
      <stringProp name="TestPlan.comments">Signup</stringProp>
      <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
        <boolProp name="LoopController.continue_forever">false</boolProp>
        <intProp name="LoopController.loops">-1</intProp>
      </elementProp>
      <stringProp name="ThreadGroup.num_threads">20</stringProp>
      <stringProp name="ThreadGroup.ramp_time">60</stringProp>
      <boolProp name="ThreadGroup.scheduler">true</boolProp>
      <stringProp name="ThreadGroup.duration">900</stringProp>
      <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
    </ThreadGroup>
    <hashTree>
      <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="false">
        <stringProp name="CounterConfig.start">3802</stringProp>
        <stringProp name="CounterConfig.end">4000</stringProp>
        <stringProp name="CounterConfig.incr">1</stringProp>
        <stringProp name="CounterConfig.name">email_counter</stringProp>
        <stringProp name="CounterConfig.format">00000</stringProp>
        <boolProp name="CounterConfig.per_user">true</boolProp>
        <stringProp name="TestPlan.comments">Counter for email address</stringProp>
      </CounterConfig>
      <hashTree/>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST_SignupRQ" enabled="true">
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">{&#xd;
  &quot;phoneNumber&quot;: &quot;+63${__Random(100000000,999999999)}&quot;,&#xd;
  &quot;password&quot;: &quot;Asd123&quot;,&#xd;
  &quot;firstName&quot;: &quot;${__RandomString(5,abcdefghijklmnopqrstuvwxyz)}&quot;,&#xd;
  &quot;lastName&quot;: &quot;Dias${__RandomString(5,abcdefghijklmnopqrstuvwxyz)}&quot;,&#xd;
  &quot;baseLanguagePrefrerence&quot;: &quot;EN&quot;,&#xd;
  &quot;address&quot;: {&#xd;
    &quot;postalCode&quot;: &quot;10250&quot;&#xd;
  },&#xd;
  &quot;extendedAttributes&quot;: {&#xd;
    &quot;Postal_Code&quot;: &quot;10250&quot;,&#xd;
    &quot;USER_AFFILIATION&quot;: &quot;CUSTOMER&quot;,&#xd;
    &quot;EMAIL_OPT_IN&quot;: &quot;TRUE&quot;&#xd;
  },&#xd;
  &quot;email&quot;: &quot;incentivioperformace+${__Random(10000000000000,90000000000000)}@gmail.com&quot;,&#xd;
  &quot;howAcquired&quot;: &quot;THROUGH_AN_IPHONE&quot;,&#xd;
  &quot;referralCode&quot;: &quot;aet.19&quot;&#xd;
}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${ServerIP}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.path">/incentivio-mobile-api/useraccounts</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <stringProp name="TestPlan.comments">Signup Request</stringProp>
      </HTTPSamplerProxy>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="GET_SignupRQ_Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">CLIENTID</stringProp>
              <stringProp name="Header.value">793b75b3-ff9c-4356-9409-7118ab421ebb</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
          <stringProp name="TestPlan.comments">headers</stringProp>
        </HeaderManager>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>